Autodesk.Revit.DB.FormulaManager.Validate(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Document,System.String)
Validates the formuls
Remarks:
It validates formula using list of global or family parameters depends on document type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.FormulaManager.Evaluate(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Document,System.String)
Evaluates value of the formula
Remarks:
It evaluates formula using list of global or family parameters depends on document type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null